/*
Задача: Продвижение сотрудников (наследство: специализация)
Напишите программу, которая отображает структуру компании. В компании есть несколько отделов. В
каждом отделе работают несколько сотрудников и начальник отдела.
У сотрудника должны быть фамилия, имя, отчество, идентификатор, базовая зарплата, коэффициент зарплаты и
дата рождения. Коэффициент зарплаты сотрудника равен 1, а зарплата рассчитывается путем умножения коэффициента
зарплаты на базовую зарплату.
Руководитель отдела должен быть наемным работником, а также иметь фамилию, имя, отчество, идентификатор, базовый оклад,
коэффициент оклада и дату рождения. Коэффициент оклада для начальника отдела равен 2. Кроме того, у начальника отдела
должен быть метод продвижения, при котором сотрудник может быть повышен в должности. При этом коэффициент заработной
платы этого сотрудника должен быть увеличен на 10 %.
Напишите подходящий JUnit-тест для проверки вашей программы.
 */

package mitarbeiter;

public abstract class Company {
    protected String companyName;

    public String getCompanyName() {
        return companyName;
    }

    public void setCompanyName(String companyName) {
        this.companyName = companyName;
    }
}
